docs/evidence/k6/mixed-chat-smoke-20260522T092738Z-console.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: k6/mixed-chat-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 42s max duration (incl. graceful stop):
              * mixed_chat: Up to 1 looping VUs for 12s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (01.0s), 0/1 VUs, 0 complete and 0 interrupted iterations
mixed_chat   [   6% ] 0/1 VUs  00.8s/12.0s

running (02.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
mixed_chat   [  15% ] 1/1 VUs  01.8s/12.0s

running (03.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
mixed_chat   [  23% ] 1/1 VUs  02.8s/12.0s

running (04.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
mixed_chat   [  31% ] 1/1 VUs  03.8s/12.0s

running (05.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
mixed_chat   [  40% ] 1/1 VUs  04.8s/12.0s

running (06.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
mixed_chat   [  48% ] 1/1 VUs  05.8s/12.0s

running (07.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
mixed_chat   [  56% ] 1/1 VUs  06.8s/12.0s

running (08.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
mixed_chat   [  65% ] 1/1 VUs  07.8s/12.0s

running (09.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
mixed_chat   [  73% ] 1/1 VUs  08.8s/12.0s

running (10.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
mixed_chat   [  81% ] 1/1 VUs  09.8s/12.0s

running (11.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
mixed_chat   [  90% ] 1/1 VUs  10.8s/12.0s

running (12.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
mixed_chat   [  98% ] 1/1 VUs  11.8s/12.0s


  █ THRESHOLDS 

    ack_success_rate
    ✓ 'rate>0.80' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    mixed_error_rate
    ✓ 'rate<0.05' rate=0.00%

    nack_rate
    ✓ 'rate<0.01' rate=0.00%

    ws_connection_success_rate
    ✓ 'rate>0.80' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......: 37      3.00996/s
    checks_succeeded...: 100.00% 37 out of 37
    checks_failed......: 0.00%   0 out of 37

    ✓ mixed setup room created
    ✓ room list ok
    ✓ message history ok
    ✓ websocket upgraded
    ✓ message history after send ok

    CUSTOM
    ack_success_rate...............: 100.00% 9 out of 9
    acks_received..................: 9       0.732153/s
    delivery_success_rate..........: 100.00% 9 out of 9
    message_send_ack_latency.......: avg=7ms      min=6ms      med=7ms      max=8ms      p(90)=8ms      p(95)=8ms     
    messages_received..............: 9       0.732153/s
    messages_sent..................: 9       0.732153/s
    mixed_error_rate...............: 0.00%   0 out of 36
    nack_rate......................: 0.00%   0 out of 9
    send_to_receive_latency........: avg=7.11ms   min=6ms      med=7ms      max=8ms      p(90)=8ms      p(95)=8ms     

    HTTP
    http_req_duration..............: avg=12ms     min=2.13ms   med=5.03ms   max=78.45ms  p(90)=10.77ms  p(95)=76.01ms 
      { expected_response:true }...: avg=12ms     min=2.13ms   med=5.03ms   max=78.45ms  p(90)=10.77ms  p(95)=76.01ms 
    http_req_failed................: 0.00%   0 out of 31
    http_reqs......................: 31      2.521859/s

    EXECUTION
    iteration_duration.............: avg=1.22s    min=1.22s    med=1.22s    max=1.23s    p(90)=1.23s    p(95)=1.23s   
    iterations.....................: 9       0.732153/s
    vus............................: 1       min=0       max=1
    vus_max........................: 1       min=1       max=1

    NETWORK
    data_received..................: 19 kB   1.5 kB/s
    data_sent......................: 19 kB   1.6 kB/s

    WEBSOCKET
    ws_connecting..................: avg=1.56ms   min=950.87µs med=1.25ms   max=2.59ms   p(90)=2.53ms   p(95)=2.56ms  
    ws_connection_success_rate.....: 100.00% 9 out of 9
    ws_msgs_received...............: 18      1.464305/s
    ws_msgs_sent...................: 45      3.660763/s
    ws_session_duration............: avg=211.15ms min=209.15ms med=210.77ms max=213.78ms p(90)=213.48ms p(95)=213.63ms
    ws_sessions....................: 9       0.732153/s



running (12.3s), 0/1 VUs, 9 complete and 0 interrupted iterations
mixed_chat ✓ [ 100% ] 0/1 VUs  12s